alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
/*
    RExOS - embedded RTOS
    Copyright (c) 2011-2014, Alexey Kramarenko
    All rights reserved.
*/

#ifndef LPC11UXX_BITS_H
#define LPC11UXX_BITS_H

/******************************************************************************/
/*                                                                            */
/*                            SYSCON                                          */
/*                                                                            */
/******************************************************************************/

/**********  Bit definition for SYSMEMREMAP register  *************************/
#define SYSCON_SYSMEMREMAP_BOOTLOADER                  (0 << 0)
#define SYSCON_SYSMEMREMAP_USER_RAM                    (1 << 0)
#define SYSCON_SYSMEMREMAP_USER_FLASH                  (2 << 0)

/**********  Bit definition for PRESETCTRL register  **************************/
#define SYSCON_PRESETCTRL_SSP0_RST_N_POS               0
#define SYSCON_PRESETCTRL_I2C0_RST_N_POS               1
#define SYSCON_PRESETCTRL_SSP1_RST_N_POS               2
#define SYSCON_PRESETCTRL_I2C1_RST_N_POS               3
#define SYSCON_PRESETCTRL_FRG_RST_N_POS                4
#define SYSCON_PRESETCTRL_USART1_RST_N_POS             5
#define SYSCON_PRESETCTRL_USART2_RST_N_POS             6
#define SYSCON_PRESETCTRL_USART3_RST_N_POS             7
#define SYSCON_PRESETCTRL_USART4_RST_N_POS             8
#define SYSCON_PRESETCTRL_SCT0_RST_N_POS               9
#define SYSCON_PRESETCTRL_SCT1_RST_N_POS               10

/**********  Bit definition for SYSPLLCTRL register  **************************/
#define SYSCON_SYSPLLCTRL_MSEL_POS                     0
#define SYSCON_SYSPLLCTRL_MSEL_MASK                    (0x1f << 0)

#define SYSCON_SYSPLLCTRL_PSEL_POS                     5
#define SYSCON_SYSPLLCTRL_PSEL_MASK                    (3 << 5)

/**********  Bit definition for SYSPLLSTAT register  **************************/
#define SYSCON_SYSPLLSTAT_LOCK                         (1 << 0)

/**********  Bit definition for USBPLLCTRL register  **************************/
#define SYSCON_USBPLLCTRL_MSEL_POS                     0
#define SYSCON_USBPLLCTRL_PSEL_POS                     5

/**********  Bit definition for USBPLLSTAT register  **************************/
#define SYSCON_USBPLLSTAT_LOCK                         (1 << 0)

/**********  Bit definition for RTCOSCCTRL register  **************************/
#define SYSCON_RTCOSCCTRL_RTCOSCEN                     (1 << 0)

/**********  Bit definition for SYSOSCCTRL register  **************************/
#define SYSCON_SYSOSCCTRL_BYPASS                       (1 << 0)
#define SYSCON_SYSOSCCTRL_FREQRANGE                    (1 << 1)

/**********  Bit definition for WDTOSCCTRL register  **************************/
#define SYSCON_WDTOSCCTRL_DIVSEL_POS                   0
#define SYSCON_WDTOSCCTRL_DIVSEL_MASK                  (0x1f << 0)

#define SYSCON_WDTOSCCTRL_FREQSEL_POS                  5
#define SYSCON_WDTOSCCTRL_FREQSEL_MASK                 (0xf << 5)

/**********  Bit definition for SYSRSTSTAT register  **************************/
#define SYSCON_SYSRSTSTAT_POR                          (1 << 0)
#define SYSCON_SYSRSTSTAT_EXTRST                       (1 << 1)
#define SYSCON_SYSRSTSTAT_WDT                          (1 << 2)
#define SYSCON_SYSRSTSTAT_BOD                          (1 << 3)
#define SYSCON_SYSRSTSTAT_SYSRST                       (1 << 4)

/**********  Bit definition for SYSPLLCLKSEL register  ***********************/
#define SYSCON_SYSPLLCLKSEL_IRC                        (0 << 0)
#define SYSCON_SYSPLLCLKSEL_SYSOSC                     (1 << 0)
#define SYSCON_SYSPLLCLKSEL_RTCOSC                     (3 << 0)

/**********  Bit definition for SYSPLLCLKUEN register  ***********************/
#define SYSCON_SYSPLLCLKUEN_ENA                        (1 << 0)

/**********  Bit definition for USBPLLCLKSEL register  ***********************/
#define SYSCON_USBPLLCLKSEL_IRC                        (0 << 0)
#define SYSCON_USBPLLCLKSEL_SYSOSC                     (1 << 0)

/**********  Bit definition for USBPLLCLKUEN register  ***********************/
#define SYSCON_USBPLLUEN_ENA                           (1 << 0)

/**********  Bit definition for MAINCLKSEL register  *************************/
#define SYSCON_MAINCLKSEL_IRC                          (0 << 0)
#define SYSCON_MAINCLKSEL_PLLSRC                       (1 << 0)
#define SYSCON_MAINCLKSEL_WDT                          (2 << 0)
#define SYSCON_MAINCLKSEL_PLL                          (3 << 0)

/**********  Bit definition for MAINCLKUEN register  *************************/
#define SYSCON_MAINCLKUEN_ENA                          (1 << 0)

/**********  Bit definition for SYSAHBCLKCTRL register  **********************/
#define SYSCON_SYSAHBCLKCTRL_SYS_POS                   0
#define SYSCON_SYSAHBCLKCTRL_ROM_POS                   1
#define SYSCON_SYSAHBCLKCTRL_RAM0_POS                  2
#define SYSCON_SYSAHBCLKCTRL_FLASHREG_POS              3
#define SYSCON_SYSAHBCLKCTRL_FLASHARRAY_POS            4
#define SYSCON_SYSAHBCLKCTRL_I2C0_POS                  5
#define SYSCON_SYSAHBCLKCTRL_GPIO_POS                  6
#define SYSCON_SYSAHBCLKCTRL_CT16B0_POS                7
#define SYSCON_SYSAHBCLKCTRL_CT16B1_POS                8
#define SYSCON_SYSAHBCLKCTRL_CT32B0_POS                9
#define SYSCON_SYSAHBCLKCTRL_CT32B1_POS                10
#define SYSCON_SYSAHBCLKCTRL_SSP0_POS                  11
#define SYSCON_SYSAHBCLKCTRL_USART0_POS                12
#define SYSCON_SYSAHBCLKCTRL_ADC_POS                   13
#define SYSCON_SYSAHBCLKCTRL_USB_POS                   14
#define SYSCON_SYSAHBCLKCTRL_WWDT_POS                  15
#define SYSCON_SYSAHBCLKCTRL_IOCON_POS                 16
#define SYSCON_SYSAHBCLKCTRL_SSP1_POS                  18
#define SYSCON_SYSAHBCLKCTRL_PINT_POS                  19
#define SYSCON_SYSAHBCLKCTRL_USART1_POS                20
#define SYSCON_SYSAHBCLKCTRL_USART2_POS                21
#define SYSCON_SYSAHBCLKCTRL_USART3_4_POS              22
#define SYSCON_SYSAHBCLKCTRL_GROUP0INT_POS             23
#define SYSCON_SYSAHBCLKCTRL_GROUP1INT_POS             24
#define SYSCON_SYSAHBCLKCTRL_I2C1_POS                  25
#define SYSCON_SYSAHBCLKCTRL_RAM1_POS                  26
#define SYSCON_SYSAHBCLKCTRL_USBRAM_POS                27
#define SYSCON_SYSAHBCLKCTRL_CRC_POS                   28
#define SYSCON_SYSAHBCLKCTRL_DMA_POS                   29
#define SYSCON_SYSAHBCLKCTRL_RTC_POS                   30
#define SYSCON_SYSAHBCLKCTRL_SCT0_1_POS                31

