alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
/**********  Bit definition for USBCLKSEL register  **************************/
#define SYSCON_USBCLKSEL_PLL                           (0 << 0)
#define SYSCON_USBCLKSEL_MAIN                          (1 << 0)

/**********  Bit definition for USBCLKUEN register  **************************/
#define SYSCON_USBCLKUEN_ENA                           (1 << 0)

/**********  Bit definition for CLKOUTSEL register  **************************/
#define SYSCON_CLKOUTSEL_IRC                           (0 << 0)
#define SYSCON_CLKOUTSEL_SYSOSC                        (1 << 0)
#define SYSCON_CLKOUTSEL_WDT                           (2 << 0)
#define SYSCON_CLKOUTSEL_MAIN                          (3 << 0)

/**********  Bit definition for CLKOUTUEN register  **************************/
#define SYSCON_CLKOUT_ENA                              (1 << 0)

/**********  Bit definition for EXTTRACECMD register  ************************/
#define SYSCON_EXTTRACECMD_START                       (1 << 0)
#define SYSCON_EXTTRACECMD_STOP                        (1 << 1)

/**********  Bit definition for BODCTR register  *****************************/
#define SYSCON_BODCTR_BODRSTLEV_POS                    0
#define SYSCON_BODCTR_BODRSTLEV_MASK                   (3 << 0)
#define SYSCON_BODCTR_BODRSTLEV_LEVEL0                 (0 << 0)
#define SYSCON_BODCTR_BODRSTLEV_LEVEL1                 (1 << 0)
#define SYSCON_BODCTR_BODRSTLEV_LEVEL2                 (2 << 0)
#define SYSCON_BODCTR_BODRSTLEV_LEVEL3                 (3 << 0)

#define SYSCON_BODCTR_BODINTVAL_POS                    2
#define SYSCON_BODCTR_BODINTVAL_MASK                   (3 << 2)
#define SYSCON_BODCTR_BODINTVAL_LEVEL2                 (2 << 2)
#define SYSCON_BODCTR_BODINTVAL_LEVEL3                 (3 << 2)

#define SYSCON_BODCTR_BODRSTENA                        (1 << 4)

/**********  Bit definition for NSISRC register  *****************************/
#define SYSCON_NMISRC_IRQN_POS                         0
#define SYSCON_NMISRC_IRQN_MASK                        (0xf << 0)

#define SYSCON_NMISRC_NMIEN                            (1 << 31)

/**********  Bit definition for USBCLKCTRL register  *************************/
#define SYSCON_USBCLKCTRL_APCLK                        (1 << 0)
#define SYSCON_USBCLKCTRL_POL_CLK                      (1 << 1)

/**********  Bit definition for USBCLKST register  ***************************/
#define SYSCON_USBCLKST_NEED_CLKST                     (1 << 0)

/**********  Bit definition for STARTERP1 register  **************************/
#define SYSCON_STARTERP1_RTCINT                        (1 << 12)
#define SYSCON_STARTERP1_WWDT_BODINT                   (1 << 13)
#define SYSCON_STARTERP1_USB_WAKEUP                    (1 << 19)
#define SYSCON_STARTERP1_GROUP0INT                     (1 << 20)
#define SYSCON_STARTERP1_GROUP1INT                     (1 << 21)
#define SYSCON_STARTERP1_USART1_4                      (1 << 23)
#define SYSCON_STARTERP1_USART2_3                      (1 << 24)

/**********  Bit definition for PDSLEEPCFG register  **************************/
#define SYSCON_PDSLEEPCFG_BODPD                        (1 << 3)
#define SYSCON_PDSLEEPCFG_WDTOSC_PD                    (1 << 6)

/**********  Bit definition for PDAWAKECFG register  **************************/
#define SYSCON_PDAWAKECFG_IRCOUT_PD                    (1 << 0)
#define SYSCON_PDAWAKECFG_IRC_PD                       (1 << 1)
#define SYSCON_PDAWAKECFG_FLASH_PD                     (1 << 2)
#define SYSCON_PDAWAKECFG_BOD_PD                       (1 << 3)
#define SYSCON_PDAWAKECFG_ADC_PD                       (1 << 4)
#define SYSCON_PDAWAKECFG_SYSOSC_PD                    (1 << 5)
#define SYSCON_PDAWAKECFG_WDTOSC_PD                    (1 << 6)
#define SYSCON_PDAWAKECFG_SYSPLL_PD                    (1 << 7)
#define SYSCON_PDAWAKECFG_USBPLL_PD                    (1 << 8)
#define SYSCON_PDAWAKECFG_USBPAD_PD                    (1 << 10)
#define SYSCON_PDAWAKECFG_TEMPSENSE_PD                 (1 << 13)

/**********  Bit definition for PDRUNCFG register  ***************************/
#define SYSCON_PDRUNCFG_IRCOUT_PD                      (1 << 0)
#define SYSCON_PDRUNCFG_IRC_PD                         (1 << 1)
#define SYSCON_PDRUNCFG_FLASH_PD                       (1 << 2)
#define SYSCON_PDRUNCFG_BOD_PD                         (1 << 3)
#define SYSCON_PDRUNCFG_ADC_PD                         (1 << 4)
#define SYSCON_PDRUNCFG_SYSOSC_PD                      (1 << 5)
#define SYSCON_PDRUNCFG_WDTOSC_PD                      (1 << 6)
#define SYSCON_PDRUNCFG_SYSPLL_PD                      (1 << 7)
#define SYSCON_PDRUNCFG_USBPLL_PD                      (1 << 8)
#define SYSCON_PDRUNCFG_USBPAD_PD                      (1 << 10)
#define SYSCON_PDRUNCFG_TEMPSENSE_PD                   (1 << 13)

/******************************************************************************/
/*                                                                            */
/*                            IOCON                                           */
/*                                                                            */
/******************************************************************************/

/********  Bit definition for IOCON_PIOx_x registers  ***********************/
#define IOCON_PIO_MODE_INACTIVE                     (0 << 3)         /* Selects function mode (on-chip pull-up/pull-down resistor control). */
                                                                     /* 0x0 Inactive (no pull-down/pull-up resistor enabled). */
#define IOCON_PIO_MODE_PULL_DOWN                    (1 << 3)         /* 0x1 Pull-down resistor enabled. */
#define IOCON_PIO_MODE_PULL_UP                      (2 << 3)         /* 0x2 Pull-up resistor enabled. */
#define IOCON_PIO_MODE_REPEATER                     (3 << 3)         /* 0x3 Repeater mode */
#define IOCON_PIO_HYS                               (1 << 5)         /* Hysteresis.
                                                                        0 Disable.
                                                                        1 Enable */
#define IOCON_PIO_INV                               (1 << 6)         /* Invert input
                                                                        0 Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).
                                                                        1 Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1) */
#define IOCON_PIO_OD                                (1 << 10)        /* Open-drain mode.
                                                                        0 Disable.
                                                                        1 Open-drain mode enabled.
                                                                        Remark: This is not a true open-drain mode */
#define IOCON_PIO_I2CMODE_STANDART                  (0 << 8)         /* Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) */
#define IOCON_PIO_I2CMODE_GPIO                      (1 << 8)         /* if the pin function is GPIO (FUNC = 000) */
#define IOCON_PIO_I2CMODE_FAST                      (2 << 8)
#define IOCON_PIO_ADMODE                            (1 << 7)         /* Selects Analog/Digital mode.
                                                                         0 Analog input mode.
                                                                         1 Digital functional mode */
#define IOCON_PIO_FILTR                             (1 << 8)         /* Selects 10 ns input glitch filter.
                                                                        0 Filter enabled.
                                                                        1 Filter disabled */

//PIO0_0
#define PIO0_0_RESET                                0
#define PIO0_0_GPIO                                 1

//PIO0_1
#define PIO0_1_GPIO                                 0
#define PIO0_1_CLKOUT                               1
#define PIO0_1_CT32B0_MAT2                          2
#define PIO0_1_USB_FTOGGLE                          3

//PIO0_2
#define PIO0_2_GPIO                                 0
#define PIO0_2_SSEL0                                1
#define PIO0_2_CT16B0_CAP0                          2
#define PIO0_2_IOH_0                                3

//PIO0_3
#define PIO0_3_GPIO                                 0
#define PIO0_3_VBUS                                 1
#define PIO0_3_IOH_1                                2

