alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
//PIO0_4
#define PIO0_4_GPIO                                 0
#define PIO0_4_I2C_SCL                              1
#define PIO0_4_IOH_2                                2

//PIO0_5
#define PIO0_5_GPIO                                 0
#define PIO0_6_I2C_SDA                              1
#define PIO0_6_IOH_3                                2

//PIO0_6
#define PIO0_6_GPIO                                 0
#define PIO0_6_USB_CONNECT                          1
#define PIO0_6_SCK0                                 2
#define PIO0_6_SCK0_IOH_4                           3

//PIO0_7
#define PIO0_7_GPIO                                 0
#define PIO0_7_CTS                                  1
#define PIO0_7_IOH_5                                2

//PIO0_8
#define PIO0_8_GPIO                                 0
#define PIO0_8_MIS00                                1
#define PIO0_8_CT16B0_MAT0                          2
#define PIO0_8_IOH_6                                4

//PIO0_9
#define PIO0_9_GPIO                                 0
#define PIO0_9_MOSI0                                1
#define PIO0_9_CT16B0_MAT1                          2
#define PIO0_9_IOH_7                                4

//PIO0_10
#define PIO0_10_SWCLK                               0
#define PIO0_10_GPIO                                1
#define PIO0_10_SCK0                                2
#define PIO0_10_CT16B0_MAT2                         3

//PIO0_11
#define PIO0_11_TDI                                 0
#define PIO0_11_GPIO                                1
#define PIO0_11_AD0                                 2
#define PIO0_11_CT32B0_MAT3                         3

//PIO0_12
#define PIO0_12_TMS                                 0
#define PIO0_12_GPIO                                1
#define PIO0_12_AD1                                 2
#define PIO0_12_CT32B1_CAP0                         3

//PIO0_13
#define PIO0_13_TDO                                 0
#define PIO0_13_GPIO                                1
#define PIO0_13_AD2                                 2
#define PIO0_13_CT32B1_MAT0                         3

//PIO0_14
#define PIO0_14_TRST                                0
#define PIO0_14_GPIO                                1
#define PIO0_14_AD3                                 2
#define PIO0_14_CT32B1_MAT1                         3

//PIO0_15
#define PIO0_15_SDIO                                0
#define PIO0_15_GPIO                                1
#define PIO0_15_AD4                                 2
#define PIO0_15_CT32B1_MAT2                         3

//PIO0_16
#define PIO0_16_GPIO                                0
#define PIO0_16_AD5                                 1
#define PIO0_16_CT32B1_MAT3                         2
#define PIO0_16_IOH_8                               3

//PIO0_17
#define PIO0_17_GPIO                                0
#define PIO0_17_RTS                                 1
#define PIO0_17_CT32B0_CAP0                         2
#define PIO0_17_SCLK                                3

//PIO0_18
#define PIO0_18_GPIO                                0
#define PIO0_18_RXD                                 1
#define PIO0_18_CT32B0_MAT0                         2

//PIO0_19
#define PIO0_19_GPIO                                0
#define PIO0_19_TXD                                 1
#define PIO0_19_CT32B0_MAT1                         2

//PIO0_20
#define PIO0_20_GPIO                                0
#define PIO0_20_CT16B1_CAP0                         1

//PIO0_21
#define PIO0_21_GPIO                                0
#define PIO0_21_CT16B1_MAT0                         1
#define PIO0_21_MOSI1                               2

//PIO0_22
#define PIO0_22_GPIO                                0
#define PIO0_22_AD6                                 1
#define PIO0_22_CT16B1_MAT1                         2
#define PIO0_22_MISO1                               3

//PIO0_23
#define PIO0_23_GPIO                                0
#define PIO0_23_AD7                                 1
#define PIO0_23_IOH_9                               2

//PIO1_0
#define PIO1_0_GPIO                                 0
#define PIO1_0_CT32B1_MAT1                          1
#define PIO1_0_IOH_10                               2

//PIO1_1
#define PIO1_1_GPIO                                 0
#define PIO1_1_CT32B1_MAT1                          1
#define PIO1_1_IOH_10                               2

//PIO1_2
#define PIO1_2_GPIO                                 0
#define PIO1_2_CT32B1_MAT2                          1
#define PIO1_2_IOH_12                               2

//PIO1_3
#define PIO1_3_GPIO                                 0
#define PIO1_3_CT32B1_MAT3                          1
#define PIO1_3_IOH_13                               2

//PIO1_4
#define PIO1_4_GPIO                                 0
#define PIO1_4_CT32B1_CAP0                          1
#define PIO1_4_IOH_14                               2

//PIO1_5
#define PIO1_5_GPIO                                 0
#define PIO1_5_CT32B1_CAP1                          1
#define PIO1_5_IOH_15                               2

//PIO1_6
#define PIO1_6_GPIO                                 0
#define PIO1_6_IOH_16                               1

//PIO1_7
#define PIO1_7_GPIO                                 0
#define PIO1_7_IOH_17                               1

//PIO1_8
#define PIO1_8_GPIO                                 0
#define PIO1_8_IOH_18                               1

//PIO1_9
#define PIO1_9_GPIO                                 0

//PIO1_10
#define PIO1_10_GPIO                                0

//PIO1_11
#define PIO1_11_GPIO                                0

//PIO1_12
#define PIO1_12_GPIO                                0

//PIO1_13
#define PIO1_13_GPIO                                0
#define PIO1_13_DTR                                 1
#define PIO1_13_CT16B0_MAT0                         2
#define PIO1_13_TXD                                 3

//PIO1_14
#define PIO1_14_GPIO                                0
#define PIO1_14_DSR                                 1
#define PIO1_14_CT16B0_MAT1                         2
#define PIO1_14_RXD                                 3

//PIO1_15
#define PIO1_15_GPIO                                0
#define PIO1_15_DCD                                 1
#define PIO1_15_CT16B0_MAT2                         2
#define PIO1_15_SCK1                                3

//PIO1_16
#define PIO1_16_GPIO                                0
#define PIO1_16_RI                                  1
#define PIO1_16_CT16B0_CAP0                         2

//PIO1_17
#define PIO1_17_GPIO                                0
#define PIO1_17_CT16B0_CAP1                         1
#define PIO1_17_RXD                                 2

