alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
//PIO1_18
#define PIO1_18_GPIO                                0
#define PIO1_18_CT16B1_CAP1                         1
#define PIO1_18_TXD                                 2

//PIO1_19
#define PIO1_19_GPIO                                0
#define PIO1_19_DTR                                 1
#define PIO1_19_SSEL1                               2

//PIO1_20
#define PIO1_20_GPIO                                0
#define PIO1_20_DSR                                 1
#define PIO1_20_SCK1                                2

//PIO1_21
#define PIO1_21_GPIO                                0
#define PIO1_21_DCD                                 1
#define PIO1_21_MISO1                               2

//PIO1_22
#define PIO1_22_GPIO                                0
#define PIO1_22_RI                                  1
#define PIO1_22_MOSI1                               2

//PIO1_23
#define PIO1_23_GPIO                                0
#define PIO1_23_CT16B1_MAT1                         1
#define PIO1_23_SSEL1                               2

//PIO1_24
#define PIO1_24_GPIO                                0
#define PIO1_24_CT32B0_MAT0                         1

//PIO1_25
#define PIO1_25_GPIO                                0
#define PIO1_25_CT32B0_MAT1                         1

//PIO1_26
#define PIO1_26_GPIO                                0
#define PIO1_26_CT32B0_MAT2                         1
#define PIO1_26_RXD                                 2
#define PIO1_26_IOH_19                              3

//PIO1_27
#define PIO1_27_GPIO                                0
#define PIO1_27_CT32B0_MAT3                         1
#define PIO1_27_TXD                                 2
#define PIO1_27_IOH_20                              3

//PIO1_28
#define PIO1_28_GPIO                                0
#define PIO1_28_CT32B0_CAP0                         1
#define PIO1_28_SCLK                                2

//PIO1_29
#define PIO1_29_GPIO                                0
#define PIO1_29_SCK0                                1
#define PIO1_29_CT32B0_CAP1                         2

//PIO1_31
#define PIO1_31_GPIO                                0


/******************************************************************************/
/*                                                                            */
/*                            USART                                           */
/*                                                                            */
/******************************************************************************/

/**********  Bit definition for IER register  *********************************/
#define USART0_IER_RBRIE_Msk                        (1 << 0)
#define USART0_IER_THREIE_Msk                       (1 << 1)
#define USART0_IER_RLSINTEN_Msk                     (1 << 2)
#define USART0_IER_MSIINTEN_Msk                     (1 << 3)
#define USART0_IER_ABEOINTEN_Msk                    (1 << 8)
#define USART0_IER_ABTOINTEN_Msk                    (1 << 9)

/**********  Bit definition for IIR register  *********************************/
#define USART0_IIR_INTSTATUS_Msk                   (1 << 0)

#define USART0_IIR_INTID_Msk                       (7 << 1)
#define USART0_IIR_INTID_MODEM_STATUS              (0 << 1)
#define USART0_IIR_INTID_THRE                      (1 << 1)
#define USART0_IIR_INTID_RDA                       (2 << 1)
#define USART0_IIR_INTID_RLS                       (3 << 1)
#define USART0_IIR_INTID_CTI                       (6 << 1)

#define USART0_IIR_FIFOEN_Msk                      (3 << 6)

#define USART0_IIR_ABEOINT_Msk                     (1 << 8)
#define USART0_IIR_ABTOINT_Msk                     (1 << 9)

/**********  Bit definition for FCR register  *********************************/
#define USART0_FCR_FIFOEN_Msk                      (1 << 0)
#define USART0_FCR_RXFIFORES_Msk                   (1 << 1)
#define USART0_FCR_TXFIFORES_Msk                   (1 << 2)

#define USART0_FCR_RXTL_1                          (0 << 6)
#define USART0_FCR_RXTL_4                          (1 << 6)
#define USART0_FCR_RXTL_8                          (2 << 6)
#define USART0_FCR_RXTL_14                         (3 << 6)

/**********  Bit definition for LCR register  *********************************/
#define USART0_LCR_WLS_Pos                         0
#define USART0_LCR_WLS_Msk                         (3 << 0)
#define USART0_LCR_WLS_5                           (0 << 0)
#define USART0_LCR_WLS_6                           (1 << 0)
#define USART0_LCR_WLS_7                           (2 << 0)
#define USART0_LCR_WLS_8                           (3 << 0)

#define USART0_LCR_SBS_Pos                         2
#define USART0_LCR_SBS_1                           (0 << 2)
#define USART0_LCR_SBS_2                           (1 << 2)

#define USART0_LCR_PE_Msk                          (1 << 3)

#define USART0_LCR_PS_Msk                          (3 << 4)
#define USART0_LCR_PS_ODD                          (0 << 4)
#define USART0_LCR_PS_EVEN                         (1 << 4)
#define USART0_LCR_PS_FORCE_1                      (2 << 4)
#define USART0_LCR_PS_FORCE_0                      (3 << 4)

#define USART0_LCR_BC_Msk                          (1 << 6)
#define USART0_LCR_DLAB_Msk                        (1 << 7)

/**********  Bit definition for MCR register  *********************************/
#define USART0_MCR_DTRCTRL_Msk                     (1 << 0)
#define USART0_MCR_RTSCTRL_Msk                     (1 << 1)
#define USART0_MCR_LMS_Msk                         (1 << 4)
#define USART0_MCR_RTSEN_Msk                       (1 << 6)
#define USART0_MCR_CTSEN_Msk                       (1 << 7)

/**********  Bit definition for LSR register  *********************************/
#define USART0_LSR_RDR_Msk                         (1 << 0)
#define USART0_LSR_OE_Msk                          (1 << 1)
#define USART0_LSR_PE_Msk                          (1 << 2)
#define USART0_LSR_FE_Msk                          (1 << 3)
#define USART0_LSR_BI_Msk                          (1 << 4)
#define USART0_LSR_THRE_Msk                        (1 << 5)
#define USART0_LSR_TEMT_Msk                        (1 << 6)
#define USART0_LSR_RXFE_Msk                        (1 << 7)
#define USART0_LSR_TXERR_Msk                       (1 << 8)

/**********  Bit definition for MSR register  *********************************/
#define USART0_MSR_DCTS_Msk                        (1 << 0)
#define USART0_MSR_DDSR_Msk                        (1 << 1)
#define USART0_MSR_TERI_Msk                        (1 << 2)
#define USART0_MSR_DDCR_Msk                        (1 << 3)
#define USART0_MSR_CTS_Msk                         (1 << 4)
#define USART0_MSR_DSR_Msk                         (1 << 5)
#define USART0_MSR_RI_Msk                          (1 << 6)
#define USART0_MSR_DCD_Msk                         (1 << 7)

/**********  Bit definition for ACR register  *********************************/
#define USART0_ACR_START_Msk                       (1 << 0)
#define USART0_ACR_MODE_Msk                        (1 << 1)
#define USART0_ACR_AUTORESTART_Msk                 (1 << 2)
#define USART0_ACR_ABEOINTCLR_Msk                  (1 << 8)
#define USART0_ACR_ABTOINTCLR_Msk                  (1 << 9)

