alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
/**********  Bit definition for ICR register  *********************************/
#define USART0_ICR_IRDAEN_Msk                      (1 << 0)
#define USART0_ICR_IRDAINV_Msk                     (1 << 1)
#define USART0_ICR_FIXPULSEEN_Msk                  (1 << 2)

#define USART0_ICR_PULSEDIV_Msk                    (7 << 3)
#define USART0_ICR_PULSEDIV_3_16                   (0 << 3)
#define USART0_ICR_PULSEDIV_2TPCLK                 (1 << 3)
#define USART0_ICR_PULSEDIV_4TPCLK                 (2 << 3)
#define USART0_ICR_PULSEDIV_8TPCLK                 (3 << 3)
#define USART0_ICR_PULSEDIV_16TPCL                 (4 << 3)
#define USART0_ICR_PULSEDIV_32TPCL                 (5 << 3)
#define USART0_ICR_PULSEDIV_64TPCL                 (6 << 3)
#define USART0_ICR_PULSEDIV_128TPC                 (7 << 3)

/**********  Bit definition for FDR register  *********************************/
#define USART0_FDR_DIVADDVAL_Msk                   (0xf << 0)
#define USART0_FDR_DIVADDVAL_Pos                   0
#define USART0_FDR_MULVAL_Msk                      (0xf << 4)
#define USART0_FDR_MULVAL_Pos                      4

/**********  Bit definition for OSR register  *********************************/
#define USART0_OSR_OSFRAC_Msk                      (7 << 1)
#define USART0_OSR_OSFRAC_Pos                      1
#define USART0_OSR_OSINT_Msk                       (0xf << 4)
#define USART0_OSR_OSINT_Pos                       4

#define USART0_OSR_FDINT_Msk                       (0x7f << 8)
#define USART0_OSR_FDINT_Pos                       8

/**********  Bit definition for TER register  *********************************/
#define USART0_TER_TXEN_Msk                        (1 << 0)

/**********  Bit definition for HDEN register  ********************************/
#define USART0_HDEN_HDEN_Msk                       (1 << 0)

/**********  Bit definition for SCICTRL register  *****************************/
#define USART0_SCICTRL_SCIEN_Msk                   (1 << 0)
#define USART0_SCICTRL_NACKDIS_Msk                 (1 << 1)
#define USART0_SCICTRL_PROTSEL_Msk                 (1 << 2)

#define USART0_SCICTRL_TXRETRY_Msk                 (7 << 5)
#define USART0_SCICTRL_TXRETRY_Pos                 5

#define USART0_SCICTRL_XTRAGUARD_Msk               (0xff << 8)
#define USART0_SCICTRL_XTRAGUARD_Pos               8

/**********  Bit definition for RS485CTRL register  ***************************/
#define USART0_RS485CTRL_NMMEN_Msk                 (1 << 0)
#define USART0_RS485CTRL_RXDIS_Msk                 (1 << 1)
#define USART0_RS485CTRL_AADEN_Msk                 (1 << 2)
#define USART0_RS485CTRL_SEL_Msk                   (1 << 3)
#define USART0_RS485CTRL_DCTRL_Msk                 (1 << 4)
#define USART0_RS485CTRL_OINV_Msk                  (1 << 5)

/**********  Bit definition for SYNCCTRL register  ****************************/
#define USART0_SYNCCTRL_SYNC_Msk                   (1 << 0)
#define USART0_SYNCCTRL_CSRC_Msk                   (1 << 1)
#define USART0_SYNCCTRL_FES_Msk                    (1 << 2)
#define USART0_SYNCCTRL_TSBYPASS_Msk               (1 << 3)
#define USART0_SYNCCTRL_CSCEN_Msk                  (1 << 4)
#define USART0_SYNCCTRL_SSDIS_Msk                  (1 << 5)
#define USART0_SYNCCTRL_CCCLR_Msk                    (1 << 6)

/******************************************************************************/
/*                                                                            */
/*                            USART(1-4) LPC11U6xx                            */
/*                                                                            */
/******************************************************************************/

//USART1-4 (LPC11U6xx)

/**********  Bit definition for CFG register  *********************************/
#define USART4_CFG_ENABLE                       (1 << 0)

#define USART4_CFG_DATALEN_POS                  2
#define USART4_CFG_DATALEN_MASK                 (3 << 2)
#define USART4_CFG_DATALEN_7                    (0 << 2)
#define USART4_CFG_DATALEN_8                    (1 << 2)
#define USART4_CFG_DATALEN_9                    (2 << 2)

#define USART4_CFG_PARITYSEL_POS                4
#define USART4_CFG_PARITYSEL_MASK               (3 << 4)
#define USART4_CFG_PARITYSEL_NO_PARITY          (0 << 4)
#define USART4_CFG_PARITYSEL_EVEN               (2 << 4)
#define USART4_CFG_PARITYSEL_ODD                (3 << 4)

#define USART4_CFG_STOPLEN_POS                  6
#define USART4_CFG_STOPLEN_1                    (0 << 6)
#define USART4_CFG_STOPLEN_2                    (1 << 6)

#define USART4_CFG_MODE32K                      (1 << 7)
#define USART4_CFG_CTSEN                        (1 << 9)
#define USART4_CFG_SYNCEN                       (1 << 11)
#define USART4_CFG_CLKPOL                       (1 << 12)
#define USART4_CFG_SYNMST                       (1 << 14)
#define USART4_CFG_LOOP                         (1 << 15)
#define USART4_CFG_OETA                         (1 << 18)
#define USART4_CFG_AUTOADDR                     (1 << 19)
#define USART4_CFG_OESEL                        (1 << 20)
#define USART4_CFG_OEPOL                        (1 << 21)
#define USART4_CFG_RXPOL                        (1 << 22)
#define USART4_CFG_TXPOL                        (1 << 23)

/**********  Bit definition for CTL register  ********************************/
#define USART4_CTL_TXBRKEN                      (1 << 1)
#define USART4_CTL_ADDRDET                      (1 << 2)
#define USART4_CTL_TXDIS                        (1 << 6)
#define USART4_CTL_CC                           (1 << 8)
#define USART4_CTL_CLRCCONRX                    (1 << 9)
#define USART4_CTL_AUTOBAUD                     (1 << 16)

/**********  Bit definition for STAT register  *******************************/
#define USART4_STAT_RXRDY                       (1 << 0)
#define USART4_STAT_RXIDLE                      (1 << 1)
#define USART4_STAT_TXRDY                       (1 << 2)
#define USART4_STAT_TXIDLE                      (1 << 3)
#define USART4_STAT_CTS                         (1 << 4)
#define USART4_STAT_DELTACTS                    (1 << 5)
#define USART4_STAT_TXDISTAT                    (1 << 6)
#define USART4_STAT_OVERRUNINT                  (1 << 8)
#define USART4_STAT_RXBRK                       (1 << 10)
#define USART4_STAT_DELTARXBRK                  (1 << 11)
#define USART4_STAT_START                       (1 << 12)
#define USART4_STAT_FRAMERRINT                  (1 << 13)
#define USART4_STAT_PERITYERRINT                (1 << 14)
#define USART4_STAT_RXNOISEINT                  (1 << 15)
#define USART4_STAT_ABERR                       (1 << 16)

/**********  Bit definition for INTENSET register  ****************************/
#define USART4_INTENSET_RXRDYEN                 (1 << 0)
#define USART4_INTENSET_TXRDYEN                 (1 << 2)
#define USART4_INTENSET_TXIDLEEN                (1 << 3)
#define USART4_INTENSET_DELTACTSEN              (1 << 5)
#define USART4_INTENSET_TXDISEN                 (1 << 6)
#define USART4_INTENSET_OVERRUNEN               (1 << 8)
#define USART4_INTENSET_DELTARXBRKEN            (1 << 11)
#define USART4_INTENSET_STARTEN                 (1 << 12)
#define USART4_INTENSET_FRAMERREN               (1 << 13)
#define USART4_INTENSET_PERITYERREN             (1 << 14)
#define USART4_INTENSET_RXNOISEEN               (1 << 15)
#define USART4_INTENSET_ABERREN                 (1 << 16)

/**********  Bit definition for INTENCLR register  ****************************/
#define USART4_INTENCLR_RXRDYCLR                (1 << 0)
#define USART4_INTENCLR_TXRDYCLR                (1 << 2)
#define USART4_INTENCLR_TXIDLECLR               (1 << 3)
#define USART4_INTENCLR_DELTACTSCLR             (1 << 5)
#define USART4_INTENCLR_TXDISCLR                (1 << 6)
#define USART4_INTENCLR_OVERRUNCLR              (1 << 8)
#define USART4_INTENCLR_DELTARXBRKCLR           (1 << 11)
#define USART4_INTENCLR_STARTCLR                (1 << 12)
#define USART4_INTENCLR_FRAMERRCLR              (1 << 13)
#define USART4_INTENCLR_PERITYERRCLR            (1 << 14)
#define USART4_INTENCLR_RXNOISECLR              (1 << 15)
#define USART4_INTENCLR_ABERRCLR                (1 << 16)

