alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
/**********  Bit definition for MMCTRL register  ******************************/
#define I2C_MMCTRL_MMENA                        (1 << 0)                /* Monitor mode enable */
#define I2C_MMCTRL_ENASCL                       (1 << 1)                /* SCL output enable */
#define I2C_MMCTRL_MATCH_ALL                    (1 << 2)                /* Select interrupt register match */


/******************************************************************************/
/*                                                                            */
/*                            Timer16/32                                      */
/*                                                                            */
/******************************************************************************/

/**********  Bit definition for IR register  **********************************/
#define TIMER0_IR_MR0INT_Msk                    (1 << 0)                /* Interrupt flag for match channel 0 */
#define TIMER0_IR_MR1INT_Msk                    (1 << 1)                /* Interrupt flag for match channel 0 */
#define TIMER0_IR_MR2INT_Msk                    (1 << 2)                /* Interrupt flag for match channel 0 */
#define TIMER0_IR_MR3INT_Msk                    (1 << 3)                /* Interrupt flag for match channel 0 */
#define TIMER0_IR_CR0INT_Msk                    (1 << 4)                /* Interrupt flag for capture channel 0 event */

#define TIMER1_IR_CR1INT_Msk                    (1 << 5)                /* Interrupt flag for capture channel 1 event CTxxB1 */
#define TIMER0_IR_CR1INT_Msk                    (1 << 6)                /* Interrupt flag for capture channel 1 event CTxxB0 */

/**********  Bit definition for TCR register  *********************************/
#define TIMER0_TCR_CEN_Msk                      (1 << 0)                /* Counter enable */
#define TIMER0_TCR_CRST_Msk                     (1 << 1)                /* Counter reset */

/**********  Bit definition for MCR register  *********************************/
#define TIMER0_MCR_MR0I_Msk                     (1 << 0)                /* Interrupt on MR0: an interrupt is generated when MR0 matches the value in the TC */
#define TIMER0_MCR_MR0R_Msk                     (1 << 1)                /* Reset on MR0: the TC will be reset if MR0 matches it */
#define TIMER0_MCR_MR0S_Msk                     (1 << 2)                /* Stop on MR0: the TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC */
#define TIMER0_MCR_MR1I_Msk                     (1 << 3)                /* Interrupt on MR1: an interrupt is generated when MR1 matches the value in the TC */
#define TIMER0_MCR_MR1R_Msk                     (1 << 4)                /* Reset on MR1: the TC will be reset if MR1 matches it */
#define TIMER0_MCR_MR1S_Msk                     (1 << 5)                /* Stop on MR1: the TC and PC will be stopped and TCR[1] will be set to 0 if MR1 matches the TC */
#define TIMER0_MCR_MR2I_Msk                     (1 << 6)                /* Interrupt on MR2: an interrupt is generated when MR2 matches the value in the TC */
#define TIMER0_MCR_MR2R_Msk                     (1 << 7)                /* Reset on MR2: the TC will be reset if MR2 matches it */
#define TIMER0_MCR_MR2S_Msk                     (1 << 8)                /* Stop on MR2: the TC and PC will be stopped and TCR[2] will be set to 0 if MR2 matches the TC */
#define TIMER0_MCR_MR3I_Msk                     (1 << 9)                /* Interrupt on MR3: an interrupt is generated when MR3 matches the value in the TC */
#define TIMER0_MCR_MR3R_Msk                     (1 << 10)               /* Reset on MR3: the TC will be reset if MR3 matches it */
#define TIMER0_MCR_MR3S_Msk                     (1 << 11)               /* Stop on MR3: the TC and PC will be stopped and TCR[3] will be set to 0 if MR3 matches the TC */

/**********  Bit definition for CCR register  *********************************/
#define TIMER0_CCR_CAP0RE_Msk                   (1 << 0)                /* Capture on CTxxBx_CAP0 rising edge: a sequence of 0 then 1 on CTxxBx_CAP0 will
                                                                           cause CR0 to be loaded with the contents of TC */
#define TIMER0_CCR_CAP0FE_Msk                   (1 << 1)                /* Capture on CTxxBx_CAP0 falling edge: a sequence of 1 then 0 on CTxxBx_CAP0 will
                                                                           cause CR0 to be loaded with the contents of TC */
#define TIMER0_CCR_CAP0I_Msk                    (1 << 2)                /* Interrupt on CTxxBx_CAP0 event: a CR0 load due to a CTxxBx_CAP0 event will
                                                                           generate an interrupt */

#define TIMER1_CCR_CAP1RE_Msk                   (1 << 3)                /* Capture on CTxxB1_CAP1 rising edge: a sequence of 0 then 1 on CTxxB1_CAP1 will
                                                                           cause CR1 to be loaded with the contents of TC */
#define TIMER1_CCR_CAP1FE_Msk                   (1 << 4)                /* Capture on CTxxB1_CAP0 falling edge: a sequence of 1 then 0 on CTxxB1_CAP1 will
                                                                           cause CR1 to be loaded with the contents of TC */
#define TIMER1_CCR_CAP1I_Msk                    (1 << 5)                /* Interrupt on CTxxB1_CAP1 event: a CR1 load due to a CTxxB1_CAP1 event will
                                                                           generate an interrupt */

#define TIMER0_CCR_CAP1RE_Msk                   (1 << 6)                /* Capture on CTxxB0_CAP1 rising edge: a sequence of 0 then 1 on CTxxB0_CAP1 will
                                                                           cause CR1 to be loaded with the contents of TC */
#define TIMER0_CCR_CAP1FE_Msk                   (1 << 7)                /* Capture on CTxxB0_CAP0 falling edge: a sequence of 1 then 0 on CTxxB0_CAP1 will
                                                                           cause CR1 to be loaded with the contents of TC */
#define TIMER0_CCR_CAP1I_Msk                    (1 << 8)                /* Interrupt on CTxxB0_CAP1 event: a CR1 load due to a CTxxB0_CAP1 event will
                                                                           generate an interrupt */
/**********  Bit definition for EMR register  *********************************/
#define TIMER0_EMR_EM0_Msk                      (1 << 0)                /* External Match 0. This bit reflects the state of output CTxxBx_MAT0,
                                                                           whether or not this output is connected to its pin. When a match occurs between the TC
                                                                           and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4]
                                                                           control the functionality of this output. This bit is driven to the
                                                                           CTxxBx_MAT0 pins if the match function is selected in the IOCON
                                                                           registers (0 = LOW, 1 = HIGH) */
#define TIMER0_EMR_EM1_Msk                      (1 << 1)                /* External Match 1. This bit reflects the state of output CTxxBx_MAT1,
                                                                           whether or not this output is connected to its pin. When a match occurs between the TC
                                                                           and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6]
                                                                           control the functionality of this output. This bit is driven to the
                                                                           CTxxBx_MAT1 pins if the match function is selected in the IOCON
                                                                           registers (0 = LOW, 1 = HIGH) */
#define TIMER0_EMR_EM2_Msk                      (1 << 2)                /* External Match 2. This bit reflects the state of output CTxxBx_MAT2,
                                                                           whether or not this output is connected to its pin. When a match occurs between the TC
                                                                           and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8]
                                                                           control the functionality of this output. This bit is driven to the
                                                                           CTxxBx_MAT2 pins if the match function is selected in the IOCON
                                                                           registers (0 = LOW, 1 = HIGH) */
#define TIMER0_EMR_EM3_Msk                      (1 << 3)                /* External Match 3. This bit reflects the state of output CTxxBx_MAT3,
                                                                           whether or not this output is connected to its pin. When a match occurs between the TC
                                                                           and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10]
                                                                           control the functionality of this output. This bit is driven to the
                                                                           CTxxBx_MAT3 pins if the match function is selected in the IOCON
                                                                           registers (0 = LOW, 1 = HIGH) */
#define TIMER0_EMR_EMC0_Pos                     4                       /* External Match Control 0. Determines the functionality of External Match 0 */
#define TIMER0_EMR_EMC0_Msk                     (3 << 4)

