alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
#define TIMER0_EMR_EMC1_Pos                     6                       /* External Match Control 1. Determines the functionality of External Match 1 */
#define TIMER0_EMR_EMC1_Msk                     (3 << 6)

#define TIMER0_EMR_EMC2_Pos                     8                       /* External Match Control 2. Determines the functionality of External Match 2 */
#define TIMER0_EMR_EMC2_Msk                     (3 << 8)

#define TIMER0_EMR_EMC3_Pos                     10                      /* External Match Control 10. Determines the functionality of External Match 3 */
#define TIMER0_EMR_EMC3_Msk                     (3 << 10)

#define TIMER0_EMR_EMC_DO_NOTHING               0                       /* Do Nothing */
#define TIMER0_EMR_EMC_CLEAR                    1                       /* Clear the corresponding External Match bit/output to 0 (CTxxBx_MATx pin is LOW if
                                                                           pinned out) */
#define TIMER0_EMR_EMC_SET                      2                       /* Set the corresponding External Match bit/output to 1 (CTxxBx_MATx pin is HIGH if
                                                                           pinned out). */
#define TIMER0_EMR_EMC_TOGGLE                   3                       /* Toggle the corresponding External Match bit/output */

/**********  Bit definition for CTCR register  ********************************/
#define TIMER0_CTCR_CTM_Pos                     0                       /* Counter/Timer Mode. This field selects which rising PCLK
                                                                           edges can increment Timer’s Prescale Counter (PC), or
                                                                           clear PC and increment Timer Counter (TC) */
#define TIMER0_CTCR_CTM_TIMER                   (0 << 0)                /* Timer Mode: every rising PCLK edge */
#define TIMER0_CTCR_CTM_COUNTER_RE              (1 << 0)                /* Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2 */
#define TIMER0_CTCR_CTM_COUNTER_FE              (2 << 0)                /* Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2 */
#define TIMER0_CTCR_CTM_COUNTER_BE              (3 << 0)                /* Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2 */

#define TIMER0_CTCR_CIS_Pos                     2                       /* Count Input Select. In counter mode (when bits 1:0 in this
                                                                           register are not 00), these bits select which CAP pin is
                                                                           sampled for clocking. */
#define TIMER0_CTCR_CIS_CAP0                   (0 << 2)                 /* CTxxBx_CAP0 */
#define TIMER1_CTCR_CIS_CAP1                   (1 << 2)                 /* CTxxB1_CAP1 */
#define TIMER0_CTCR_CIS_CAP1                   (2 << 2)                 /* CTxxB0_CAP1 */

#define TIMER0_CTCR_ENCC_Msk                   (1 << 4)                 /* Setting this bit to 1 enables clearing of the timer and the
                                                                           prescaler when the capture-edge event specified in bits 7:5
                                                                           occurs. */
#define TIMER0_CTCR_SELCC_Pos                  5                        /* Edge select. When bit 4 is 1, these bits select which capture input edge will cause the timer
                                                                           and prescaler to be cleared. These bits have no effect when bit 4 is low. */
#define TIMER0_CTCR_SELCC_CAP0_RE              (0 << 5)                 /* Rising Edge of CTxxBx_CAP0 clears the timer */
#define TIMER0_CTCR_SELCC_CAP0_FE              (1 << 5)                 /* Falling Edge of CTxxBx_CAP0 clears the timer */
#define TIMER1_CTCR_SELCC_CAP1_RE              (2 << 5)                 /* Rising Edge of CTxxB1_CAP1 clears the timer */
#define TIMER1_CTCR_SELCC_CAP1_FE              (3 << 5)                 /* Falling Edge of CTxxB1_CAP1 clears the timer */
#define TIMER0_CTCR_SELCC_CAP1_RE              (4 << 5)                 /* Rising Edge of CTxxB0_CAP1 clears the timer */
#define TIMER0_CTCR_SELCC_CAP1_FE              (5 << 5)                 /* Falling Edge of CTxxB0_CAP1 clears the timer */

/**********  Bit definition for PWMC register  ********************************/
#define TIMER0_PWMC_PWMEN0_Msk                 (1 << 0)                 /*  PWM mode enable for channel0 */
#define TIMER0_PWMC_PWMEN1_Msk                 (1 << 1)                 /*  PWM mode enable for channel1 */
#define TIMER0_PWMC_PWMEN2_Msk                 (1 << 2)                 /*  PWM mode enable for channel2 */
#define TIMER0_PWMC_PWMEN3_Msk                 (1 << 3)                 /*  PWM mode enable for channel3 */

/******************************************************************************/
/*                                                                            */
/*                                USB                                         */
/*                                                                            */
/******************************************************************************/

/************  Bit definition for DEVCMDSTAT register  ************************/
#define USB_DEVCMDSTAT_DEV_ADDR_POS            0                        /* USB device address. After bus reset, the address is reset to
                                                                           0x00. If the enable bit is set, the device will respond on packets
                                                                           for function address DEV_ADDR. When receiving a SetAddress
                                                                           Control Request from the USB host, software must program the
                                                                           new address before completing the status phase of the
                                                                           SetAddress Control Request */
#define USB_DEVCMDSTAT_DEV_ADDR_MASK           (0x7f << 0)

#define USB_DEVCMDSTAT_DEV_EN                  (1 << 7)                 /* USB device enable. If this bit is set, the HW will start respondingon
                                                                           packets for function address DEV_ADDR */
#define USB_DEVCMDSTAT_SETUP                   (1 << 8)                 /* SETUP token received. If a SETUP token is received and
                                                                           acknowledged by the device, this bit is set. As long as this bit is
                                                                           set all received IN and OUT tokens will be NAKed by HW. SW
                                                                           must clear this bit by writing a one. If this bit is zero, HW will
                                                                           handle the tokens to the CTRL EP0 as indicated by the CTRL
                                                                           EP0 IN and OUT data information programmed by SW */
#define USB_DEVCMDSTAT_PLL_ON                  (1 << 9)                 /* Always PLL Clock on:
                                                                           0 - USB_NeedClk functional
                                                                           1 - USB_NeedClk always 1. Clock will not be stopped in case of suspend */
#define USB_DEVCMDSTAT_LPM_SUP                 (1 << 11)                /* LPM Supported:
                                                                           0 - LPM not supported
                                                                           1 - LPM supported */
#define USB_DEVCMDSTAT_INTONNAK_AO             (1 << 12)                /* Interrupt on NAK for interrupt and bulk OUT EP
                                                                           0 - Only acknowledged packets generate an interrupt
                                                                           1 - Both acknowledged and NAKed packets generate interrupts */
#define USB_DEVCMDSTAT_INTONNAK_AI             (1 << 13)                /* Interrupt on NAK for interrupt and bulk IN EP
                                                                           0 - Only acknowledged packets generate an interrupt
                                                                           1 - Both acknowledged and NAKed packets generate interrupts */
#define USB_DEVCMDSTAT_INTONNAK_CO             (1 << 14)                /* Interrupt on NAK for interrupt and control OUT EP
                                                                           0 - Only acknowledged packets generate an interrupt
                                                                           1 - Both acknowledged and NAKed packets generate interrupts */
#define USB_DEVCMDSTAT_INTONNAK_CI             (1 << 15)                /* Interrupt on NAK for interrupt and control IN EP
                                                                           0 - Only acknowledged packets generate an interrupt
                                                                           1 - Both acknowledged and NAKed packets generate interrupts */
#define USB_DEVCMDSTAT_DCON                    (1 << 16)                /* Device status - connect.
                                                                           The connect bit must be set by SW to indicate that the device
                                                                           must signal a connect. The pull-up resistor on USB_DP will be
                                                                           enabled when this bit is set and the VbusDebounced bit is one */
#define USB_DEVCMDSTAT_DSUS                    (1 << 17)                /* Device status - suspend.
                                                                           The suspend bit indicates the current suspend state. It is set to
                                                                           1 when the device hasn’t seen any activity on its upstream port
                                                                           for more than 3 milliseconds. It is reset to 0 on any activity.
                                                                           When the device is suspended (Suspend bit DSUS = 1) and the
                                                                           software writes a 0 to it, the device will generate a remote
                                                                           wake-up. This will only happen when the device is connected
                                                                           (Connect bit = 1). When the device is not connected or not
                                                                           suspended, a writing a 0 has no effect. Writing a 1 never has an
                                                                           effect */
#define USB_DEVCMDSTAT_LPM_SUS                  (1 << 19)               /* Device status - LPM Suspend.
                                                                           This bit represents the current LPM suspend state. It is set to 1
                                                                           by HW when the device has acknowledged the LPM request
                                                                           from the USB host and the Token Retry Time of 10 s has
                                                                           elapsed. When the device is in the LPM suspended state (LPM
                                                                           suspend bit = 1) and the software writes a zero to this bit, the
                                                                           device will generate a remote walk-up. Software can only write
                                                                           a zero to this bit when the LPM_REWP bit is set to 1. HW resets
                                                                           this bit when it receives a host initiated resume. HW only
                                                                           updates the LPM_SUS bit when the LPM_SUPP bit is equal to
                                                                           one */
#define USB_DEVCMDSTAT_LPM_REWP                 (1 << 20)               /* LPM Remote Wake-up Enabled by USB host.
                                                                           HW sets this bit to one when the bRemoteWake bit in the LPM
                                                                           extended token is set to 1. HW will reset this bit to 0 when it
                                                                           receives the host initiated LPM resume, when a remote
                                                                           wake-up is sent by the device or when a USB bus reset is
                                                                           received. Software can use this bit to check if the remote
                                                                           wake-up feature is enabled by the host for the LPM transaction */
#define USB_DEVCMDSTAT_DCON_C                   (1 << 24)               /* Device status - connect change.
                                                                           The Connect Change bit is set when the device’s pull-up
                                                                           resistor is disconnected because VBus disappeared. The bit is
                                                                           reset by writing a one to it */
#define USB_DEVCMDSTAT_DSUS_C                   (1 << 25)               /* Device status - suspend change.
                                                                           The suspend change bit is set to 1 when the suspend bit
                                                                           toggles. The suspend bit can toggle because:
                                                                           - The device goes in the suspended state
                                                                           - The device is disconnected
                                                                           - The device receives resume signaling on its upstream port.
                                                                           The bit is reset by writing a one to it */
#define USB_DEVCMDSTAT_DRES_C                   (1 << 25)               /* Device status - reset change.
                                                                           This bit is set when the device received a bus reset. On a bus
                                                                           reset the device will automatically go to the default state
                                                                           (unconfigured and responding to address 0). The bit is reset by
                                                                           writing a one to it */
#define USB_DEVCMDSTAT_VBUSDEBOUNCED            (1 << 28)               /* This bit indicates if Vbus is detected or not. The bit raises
                                                                           immediately when Vbus becomes high. It drops to zero if Vbus
                                                                           is low for at least 3 ms. If this bit is high and the DCon bit is set,
                                                                           the HW will enable the pull-up resistor to signal a connect */

/************  Bit definition for INFO register  ******************************/
#define USB_INFO_FRAME_NR_POS                   0                       /* Frame number. This contains the frame number of the last
                                                                           successfully received SOF. In case no SOF was received by the
                                                                           device at the beginning of a frame, the frame number returned is
                                                                           that of the last successfully received SOF. In case the SOF frame
                                                                           number contained a CRC error, the frame number returned will be
                                                                           the corrupted frame number as received by the device */
#define USB_INFO_FRAME_NR_MASK                  (0x7ff << 0)
#define USB_INFO_ERR_CODE_MASK                  (0xf << 11)             /* The error code which last occurred */
#define USB_INFO_ERR_CODE_POS                   11

#define USB_INFO_ERR_CODE_NO_ERROR              (0x0 << 11)             /* No error */
#define USB_INFO_ERR_CODE_PID_ENCODING          (0x1 << 11)             /* PID encoding error */
#define USB_INFO_ERR_CODE_PID_UNKNOWN           (0x2 << 11)             /* PID unknown */
#define USB_INFO_ERR_CODE_PACKET_UNEXPECTED     (0x3 << 11)             /* Packet unexpected */
#define USB_INFO_ERR_CODE_TOKEN_CRC             (0x4 << 11)             /* Token CRC error */
#define USB_INFO_ERR_CODE_DATA_CRC              (0x5 << 11)             /* Data CRC error */
#define USB_INFO_ERR_CODE_TIME_OUT              (0x6 << 11)             /* Time out */
#define USB_INFO_ERR_CODE_BABBLE                (0x7 << 11)             /* Babble */
#define USB_INFO_ERR_CODE_TRUNCATED_EOP         (0x8 << 11)             /* Truncated EOP */
#define USB_INFO_ERR_CODE_IONAK                 (0x9 << 11)             /* Sent/Received NAK */
#define USB_INFO_ERR_CODE_STALL                 (0xa << 11)             /* Sent Stall */
#define USB_INFO_ERR_CODE_OVERRUN               (0xb << 11)             /* Overrun */
#define USB_INFO_ERR_CODE_EMPTY_PACKET          (0xc << 11)             /* Sent empty packet */
#define USB_INFO_ERR_CODE_BITSTUFF              (0xd << 11)             /* Bitstuff error */
#define USB_INFO_ERR_CODE_SYNC                  (0xe << 11)             /* Sync error */
#define USB_INFO_ERR_CODE_WRONG_DATA_TOGGLE     (0xf << 11)             /* Wrong data toggle */

