alexeyk13/rexos/userspace/lpc/lpc11uxx_bits.h
/************  Bit definition for LPM register  *******************************/
#define USB_LPM_HIRD_HW_POS                     0                       /* Host Initiated Resume Duration - HW. This is
                                                                           the HIRD value from the last received LPM token */
#define USB_LPM_HIRD_HW_MASK                    (0xf << 0)
#define USB_LPM_HIRD_SW_POS                     4                       /* Host Initiated Resume Duration - SW. This is
                                                                           the time duration required by the USB device
                                                                           system to come out of LPM initiated suspend
                                                                           after receiving the host initiated LPM resume */
#define USB_LPM_HIRD_SW_MASK                    (0xf << 4)
#define USB_LPM_DATA_PENDING                    (1 << 8)                /* As long as this bit is set to one and LPM
                                                                           supported bit is set to one, HW will return a
                                                                           NYET handshake on every LPM token it
                                                                           receives.
                                                                           If LPM supported bit is set to one and this bit is
                                                                           zero, HW will return an ACK handshake on
                                                                           every LPM token it receives.
                                                                           If SW has still data pending and LPM is
                                                                           supported, it must set this bit to 1 */
/************  Bit definition for INTSTAT register  ***************************/
#define USB_INTSTAT_EP0OUT                      (1 << 0)                /* Interrupt status register bit for the Control EP0 OUT direction.
                                                                           This bit will be set if NBytes transitions to zero or the skip bit is set by software
                                                                           or a SETUP packet is successfully received for the control EP0.
                                                                           If the IntOnNAK_CO is set, this bit will also be set when a NAK is transmitted
                                                                           for the Control EP0 OUT direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP0IN                       (1 << 1)                /* Interrupt status register bit for the Control EP0 IN direction.
                                                                           This bit will be set if NBytes transitions to zero or the skip bit is set by
                                                                           software.
                                                                           If the IntOnNAK_CI is set, this bit will also be set when a NAK is transmitted
                                                                           for the Control EP0 IN direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP1OUT                      (1 << 2)                /* Interrupt status register bit for the EP1 OUT direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP1 OUT direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP1IN                       (1 << 3)                /* Interrupt status register bit for the EP1 IN direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP1 IN direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP2OUT                      (1 << 4)                /* Interrupt status register bit for the EP2 OUT direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP2 OUT direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP2IN                       (1 << 5)                /* Interrupt status register bit for the EP2 IN direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP2 IN direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP3OUT                      (1 << 6)                /* Interrupt status register bit for the EP3 OUT direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP3 OUT direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP3IN                       (1 << 7)                /* Interrupt status register bit for the EP3 IN direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP3 IN direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP4OUT                      (1 << 8)                /* Interrupt status register bit for the EP4 OUT direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AO is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP4 OUT direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_EP4IN                       (1 << 9)                /* Interrupt status register bit for the EP4 IN direction.
                                                                           This bit will be set if the corresponding Active bit is cleared by HW. This is
                                                                           done in case the programmed NBytes transitions to zero or the skip bit is set
                                                                           by software.
                                                                           If the IntOnNAK_AI is set, this bit will also be set when a NAK is transmitted
                                                                           for the EP4 IN direction.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_FRAME_INT                   (1 << 30)               /* Frame interrupt.
                                                                           This bit is set to one every millisecond when the VbusDebounced bit and the
                                                                           DCON bit are set. This bit can be used by software when handling
                                                                           isochronous endpoints.
                                                                           Software can clear this bit by writing a one to it */
#define USB_INTSTAT_DEV_INT                     (1 << 31)               /* Device status interrupt. This bit is set by HW when one of the bits in the
                                                                           Device Status Change register are set. Software can clear this bit by writing a
                                                                           one to it */

